# Introduction to Pandas Lab

Complete the following set of exercises to solidify your knowledge of Pandas fundamentals.

### 1. Import Numpy and Pandas and alias them to `np` and `pd` respectively.

In [1]:
import pandas as pd
import numpy as np

### 2. Create a Pandas Series containing the elements of the list below.

In [2]:
lst = [5.7, 75.2, 74.4, 84.0, 66.5, 66.3, 55.8, 75.7, 29.1, 43.7]

In [4]:
a = pd.Series(lst)
print(a)

0     5.7
1    75.2
2    74.4
3    84.0
4    66.5
5    66.3
6    55.8
7    75.7
8    29.1
9    43.7
dtype: float64

### 3. Use indexing to return the third value in the Series above.

*Hint: Remember that indexing begins at 0.*

In [5]:
a[2]

74.4

### 4. Create a Pandas DataFrame from the list of lists below. Each sublist should be represented as a row.

In [6]:
b = [[53.1, 95.0, 67.5, 35.0, 78.4],
     [61.3, 40.8, 30.8, 37.8, 87.6],
     [20.6, 73.2, 44.2, 14.6, 91.8],
     [57.4, 0.1, 96.1, 4.2, 69.5],
     [83.6, 20.5, 85.4, 22.8, 35.9],
     [49.0, 69.0, 0.1, 31.8, 89.1],
     [23.3, 40.7, 95.0, 83.8, 26.9],
     [27.6, 26.4, 53.8, 88.8, 68.5],
     [96.6, 96.4, 53.4, 72.4, 50.1],
     [73.7, 39.0, 43.2, 81.6, 34.7]]

In [7]:
c = pd.DataFrame(b)
print(c)

      0     1     2     3     4
0  53.1  95.0  67.5  35.0  78.4
1  61.3  40.8  30.8  37.8  87.6
2  20.6  73.2  44.2  14.6  91.8
3  57.4   0.1  96.1   4.2  69.5
4  83.6  20.5  85.4  22.8  35.9
5  49.0  69.0   0.1  31.8  89.1
6  23.3  40.7  95.0  83.8  26.9
7  27.6  26.4  53.8  88.8  68.5
8  96.6  96.4  53.4  72.4  50.1
9  73.7  39.0  43.2  81.6  34.7

### 5. Rename the data frame columns based on the names in the list below.

In [8]:
b = [[53.1, 95.0, 67.5, 35.0, 78.4],
     [61.3, 40.8, 30.8, 37.8, 87.6],
     [20.6, 73.2, 44.2, 14.6, 91.8],
     [57.4, 0.1, 96.1, 4.2, 69.5],
     [83.6, 20.5, 85.4, 22.8, 35.9],
     [49.0, 69.0, 0.1, 31.8, 89.1],
     [23.3, 40.7, 95.0, 83.8, 26.9],
     [27.6, 26.4, 53.8, 88.8, 68.5],
     [96.6, 96.4, 53.4, 72.4, 50.1],
     [73.7, 39.0, 43.2, 81.6, 34.7]]

In [9]:
colnames = ['Score_1', 'Score_2', 'Score_3', 'Score_4', 'Score_5']

In [10]:
c.columns = colnames
print (c)

   Score_1  Score_2  Score_3  Score_4  Score_5
0     53.1     95.0     67.5     35.0     78.4
1     61.3     40.8     30.8     37.8     87.6
2     20.6     73.2     44.2     14.6     91.8
3     57.4      0.1     96.1      4.2     69.5
4     83.6     20.5     85.4     22.8     35.9
5     49.0     69.0      0.1     31.8     89.1
6     23.3     40.7     95.0     83.8     26.9
7     27.6     26.4     53.8     88.8     68.5
8     96.6     96.4     53.4     72.4     50.1
9     73.7     39.0     43.2     81.6     34.7

### 6. Create a subset of this data frame that contains only the Score 1, 3, and 5 columns.

In [12]:
subset_c = c[["Score_1","Score_3", "Score_5"]]
print (subset_c)

   Score_1  Score_3  Score_5
0     53.1     67.5     78.4
1     61.3     30.8     87.6
2     20.6     44.2     91.8
3     57.4     96.1     69.5
4     83.6     85.4     35.9
5     49.0      0.1     89.1
6     23.3     95.0     26.9
7     27.6     53.8     68.5
8     96.6     53.4     50.1
9     73.7     43.2     34.7

### 7. From the original data frame, calculate the average Score_3 value.

In [13]:
c["Score_3"].mean()

56.95000000000001

### 8. From the original data frame, calculate the maximum Score_4 value.

In [14]:
c["Score_4"].max()

88.8

### 9. From the original data frame, calculate the median Score 2 value.

In [15]:
c["Score_2"].median()

40.75

### 10. Create a Pandas DataFrame from the dictionary of product orders below.

In [16]:
orders = {'Description': ['LUNCH BAG APPLE DESIGN',
  'SET OF 60 VINTAGE LEAF CAKE CASES ',
  'RIBBON REEL STRIPES DESIGN ',
  'WORLD WAR 2 GLIDERS ASSTD DESIGNS',
  'PLAYING CARDS JUBILEE UNION JACK',
  'POPCORN HOLDER',
  'BOX OF VINTAGE ALPHABET BLOCKS',
  'PARTY BUNTING',
  'JAZZ HEARTS ADDRESS BOOK',
  'SET OF 4 SANTA PLACE SETTINGS'],
 'Quantity': [1, 24, 1, 2880, 2, 7, 1, 4, 10, 48],
 'UnitPrice': [1.65, 0.55, 1.65, 0.18, 1.25, 0.85, 11.95, 4.95, 0.19, 1.25],
 'Revenue': [1.65, 13.2, 1.65, 518.4, 2.5, 5.95, 11.95, 19.8, 1.9, 60.0]}

In [17]:
d = pd.DataFrame.from_dict(orders)
print(d)

                          Description  Quantity  UnitPrice  Revenue
0              LUNCH BAG APPLE DESIGN         1       1.65     1.65
1  SET OF 60 VINTAGE LEAF CAKE CASES         24       0.55    13.20
2         RIBBON REEL STRIPES DESIGN          1       1.65     1.65
3   WORLD WAR 2 GLIDERS ASSTD DESIGNS      2880       0.18   518.40
4    PLAYING CARDS JUBILEE UNION JACK         2       1.25     2.50
5                      POPCORN HOLDER         7       0.85     5.95
6      BOX OF VINTAGE ALPHABET BLOCKS         1      11.95    11.95
7                       PARTY BUNTING         4       4.95    19.80
8            JAZZ HEARTS ADDRESS BOOK        10       0.19     1.90
9       SET OF 4 SANTA PLACE SETTINGS        48       1.25    60.00

### 11. Calculate the total quantity ordered and revenue generated from these orders.

In [27]:
Total_quantity_ordered = d["Quantity"].sum()
print (f"Total quantity ordered = {Total_quantity_ordered}")
Total_revenue = d["Revenue"].sum()
print (f"Total revenue = {Total_revenue}")

Total quantity ordered = 2978
Total revenue = 637.0

In [35]:
#Trasteando un poco. Revenue = Quantity*UnitPrice
revenue_ = d["Quantity"] * d["UnitPrice"]
print (f"Total revenue = {sum(revenue_)}")

Total revenue = 637.0

### 12. Obtain the prices of the most expensive and least expensive items ordered and print the difference.

In [28]:
expensive = d["UnitPrice"].max()
least_expensive = d["UnitPrice"].min()
difference = expensive - least_expensive
print(f"The difference between the most expensive and least expensive item is = {difference}")

The difference between the most expensive and least expensive item is = 11.77

## Let's load another dataset for more exercisesº

In [29]:
# Run this code:
admissions = pd.read_csv('../Admission_Predict.csv')
#to remove trailing spaces at the end of the column names
admissions.columns = admissions.columns.str.rstrip()

Let's evaluate the dataset by looking at the `head` function.

In [30]:
admissions.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,316,104,3,3.0,3.5,8.00,1,0.72
2,3,322,110,3,3.5,2.5,8.67,1,0.80
3,4,314,103,2,2.0,3.0,8.21,0,0.65
4,5,330,115,5,4.5,3.0,9.34,1,0.90

### 1 - Before beginning to work with this dataset and evaluating graduate admissions data, we will verify that there is no missing data in the dataset. Do this in the cell below.

In [36]:
#Me esta pediendo comprobar si hay celdas vacías
admissions.isnull()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...
380,False,False,False,False,False,False,False,False,False
381,False,False,False,False,False,False,False,False,False
382,False,False,False,False,False,False,False,False,False
383,False,False,False,False,False,False,False,False,False
384,False,False,False,False,False,False,False,False,False

In [38]:
admissions.isnull().sum()

Serial No.           0
GRE Score            0
TOEFL Score          0
University Rating    0
SOP                  0
LOR                  0
CGPA                 0
Research             0
Chance of Admit      0
dtype: int64

###  2 -  Interestingly, there is a column that uniquely identifies the applicants. This column is the serial number column. Instead of having our own index, we should make this column our index. Do this in the cell below. Keep the column in the dataframe in addition to making it an index.

In [43]:
admissions.set_index("Serial No.",inplace = True)

In [44]:
admissions.head()

,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,316,104,3,3.0,3.5,8.00,1,0.72
3,322,110,3,3.5,2.5,8.67,1,0.80
4,314,103,2,2.0,3.0,8.21,0,0.65
5,330,115,5,4.5,3.0,9.34,1,0.90

Turns out that `GRE Score` and `CGPA` also uniquely identify the data. Show this in the cell below.

In [45]:
admissions2 = admissions [["GRE Score", "CGPA"]]
admissions2.head()

            GRE Score  CGPA
Serial No.
1                 337  9.65
2                 316  8.00
3                 322  8.67
4                 314  8.21
5                 330  9.34

### 3 - In this part of the lab, we would like to test complex conditions on the entire data set at once. Let's start by finding the number of rows where the CGPA is greater than 9 and the student has performed an investigation.

In [51]:
admissions3 = admissions[(admissions["CGPA"]<9) & (admissions["Research"] == 1)]
print(admissions3)

            GRE Score  TOEFL Score  University Rating  SOP  LOR  CGPA  \
Serial No.
2                 316          104                  3  3.0  3.5  8.00
3                 322          110                  3  3.5  2.5  8.67
6                 321          109                  3  3.0  4.0  8.20
12                307          109                  3  4.0  3.0  8.00
13                311          104                  3  3.5  2.0  8.20
...               ...          ...                ...  ...  ...   ...
359               321          109                  3  3.0  3.0  8.54
365               311           99                  1  2.5  3.0  8.43
366               322          104                  3  3.5  4.0  8.84
367               319          105                  3  3.0  3.5  8.67
375               320          108                  3  3.5  4.0  8.44

            Research  Chance of Admit
Serial No.
2                  1             0.72
3                  1             0.80
6                  1             0.75
12                 1             0.62
13                 1             0.61
...              ...              ...
359                1             0.79
365                1             0.71
366                1             0.78
367                1             0.73
375                1             0.76

[107 rows x 8 columns]

In [ ]:
#107 rows

#### 4 - Now return all the rows where the CGPA is greater than 9 and the SOP score is less than 3.5. Find the mean chance of admit for these applicants.

In [64]:
admissions4 = admissions[(admissions["CGPA"] > 9) & (admissions["SOP"] < 3.5)]
print(admissions4)

            GRE Score  TOEFL Score  University Rating  SOP  LOR  CGPA  \
Serial No.
29                338          118                  4  3.0  4.5  9.40
63                327          114                  3  3.0  3.0  9.02
141               326          114                  3  3.0  3.0  9.11
218               324          111                  4  3.0  3.0  9.01
382               325          107                  3  3.0  3.5  9.11

            Research  Chance of Admit
Serial No.
29                 1             0.91
63                 0             0.61
141                1             0.83
218                1             0.82
382                1             0.84

In [69]:
mean_admissions4 = admissions4["Chance of Admit"].mean()
print(f"The mean chance of admit for these applicants is {mean_admissions4}")

The mean chance of admit for these applicants is 0.8019999999999999

Let's create a new column based on the TOEFL Score column, where we put True if the TOEFL value is greater than 100 and False if it is less. We are going to do it with a function and an apply. 
To do this, we first create a function that receives an argument. The function will return True if the parameter entered is greater than 100, otherwise it will return False.

In [76]:
admissions["TOEFL2"] = [True if x > 100 else False for x in admissions["TOEFL Score"]]
admissions.head()

,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit,decision2,TOEFL2
Serial No.,,,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92,1,True
2,316,104,3,3.0,3.5,8.00,1,0.72,0,True
3,322,110,3,3.5,2.5,8.67,1,0.80,1,True
4,314,103,2,2.0,3.0,8.21,0,0.65,0,True
5,330,115,5,4.5,3.0,9.34,1,0.90,1,True

In [89]:
#Prueba
admissions ["TOEFL3"] = admissions["TOEFL Score"] > 100
admissions.head()

,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit,decision2,TOEFL2,TOEFL3
Serial No.,,,,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92,1,True,True
2,316,104,3,3.0,3.5,8.00,1,0.72,0,True,True
3,322,110,3,3.5,2.5,8.67,1,0.80,1,True,True
4,314,103,2,2.0,3.0,8.21,0,0.65,0,True,True
5,330,115,5,4.5,3.0,9.34,1,0.90,1,True,True

Now we create a new column called "Decision" and apply to the TOEFL Score column

In [125]:
#Con apply
def condicion():
    for x in admissions ["TOEFL Score"]:
        if x > 100:
            return True
        else: 
            return False

In [127]:
admissions ["Decision"] = admissions.apply(condicion)

Create a column called `decision2` in the `admissions` dataframe. Assign 1 to this column if the value of `SOP` is greater than 3 and 0 otherwise.    
HINT (use np.where)

In [86]:
admissions["decision2.1"] = [1 if x > 3 else 0 for x in admissions["SOP"]]
admissions.head()

,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit,decision2,TOEFL2,TOEFL3
Serial No.,,,,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92,1,True,True
2,316,104,3,3.0,3.5,8.00,1,0.72,0,True,True
3,322,110,3,3.5,2.5,8.67,1,0.80,1,True,True
4,314,103,2,2.0,3.0,8.21,0,0.65,0,True,True
5,330,115,5,4.5,3.0,9.34,1,0.90,1,True,True

In [108]:
#con np.where
#np.where(condition, value if condition is true, value if condition is false)
admissions["decision2"] = np.where(admissions["SOP"] > 3, "1", "0")

In [109]:
admissions.head()

,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit,decision2,TOEFL2,TOEFL3
Serial No.,,,,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92,1,True,True
2,316,104,3,3.0,3.5,8.00,1,0.72,0,True,True
3,322,110,3,3.5,2.5,8.67,1,0.80,1,True,True
4,314,103,2,2.0,3.0,8.21,0,0.65,0,True,True
5,330,115,5,4.5,3.0,9.34,1,0.90,1,True,True